import {Menu, Places} from "@/types/types";

export const places: Places = [
    {
        id: 1,
        title: 'Остров',
        price: '5 000 000',
        area: '9 га',
        cadastralNumber: '62:05:1530101:14',
        backgroundImage: '/images/places/makarovo/index.jpg',
        path: "m 922.60464,35.762991 225.82696,111.510509 -11.4213,5.20083 -13.6775,3.32081 -10.5689,3.50863 h -20.218 l -10.2207,0.6595 -2.6807,1.51142 h -12.1891 l -2.5264,2.06327 -6.1161,-1.33501 -4.5155,1.68861 -9.7604,3.94315 -7.8456,2.28903 h -4.5855 l -4.5941,1.01317 h -46.70427 l -20.99018,-1.01317 -8.50834,-1.44913 h -4.91285 l -24.43527,-14.4582 -6.49005,-3.13696 -4.3258,-0.96776 -6.54769,-1.54288 -8.53562,-2.48386 -4.88498,-3.21988 -14.06636,-13.17148 -7.95629,-5.46441 -6.02126,-6.75991 -2.04879,-6.19418 -3.07814,-5.00007 7.7184,-17.967443 7.87383,-14.553164 4.11308,-6.929309 1.08453,-2.53638 -0.91289,-6.81766 16.92906,-10.287787 7.97879,-4.749596 7.02584,-2.638595 7.83929,-2.510385 z",
        photos: [
            {
                id: 1,
                url: 'images/places/makarovo/1.jpg',
            },
            {
                id: 2,
                url: 'images/places/makarovo/2.jpg',
            },
            {
                id: 3,
                url: 'images/places/makarovo/3.jpg',
            },
            {
                id: 4,
                url: 'images/places/makarovo/4.jpg',
            },
            {
                id: 5,
                url: 'images/places/makarovo/5.jpg',
            },
        ],
        videos: [
            {
                id: 1,
                url: '/video/makarovo.mp4',
            }
        ],
        desc: 'Эксклюзивное предложение! Продаётся полуостров 900 соток в Клепиковском районе на озере Иванковское.\n' +
            'Место необыкновенно живописное, Ивановское озеро-часть цепи Мещерских озёр, крупнейшее нерестилище в Европейской части.\n' +
            'Место девственное удаленное от трасс и населённых пунктов. Грибы, ягоды, рыбалка.\n' +
            'Уединение. Тишина. Покой.\n' +
            'Идеальное место для глемпинга!\n' +
            'От МКАД - 150 км\n' +
            'От г. Рязань- 80 км\n' +
            'От Шоссе до участка 5-6 км.\n' +
            'Электричества и газоснабжения нет.\n' +
            'Рассрочка до 1 года',
    },
    {
        id: 2,
        title: 'Березовая роща',
        price: '10 000 000',
        area: '4,7 га',
        cadastralNumber: '62:05:2510101:94',
        backgroundImage: '/images/places/birch-grove/index.jpg',
        path: "m 418.25021,375.4582 210.22289,-101.59661 21.62093,27.09313 -55.37044,36.74566 -24.25175,14.71058 -30.28662,17.43272 -28.94935,14.90865 -26.31693,13.92121 -14.97026,9.59636 -16.32078,7.69356 -15.54591,8.13325 -15.41067,7.93838 z",
        photos: [
            {
                id: 1,
                url: 'images/places/birch-grove/1.jpg',
            },
            {
                id: 2,
                url: 'images/places/birch-grove/2.jpg',
            },
            {
                id: 3,
                url: 'images/places/birch-grove/3.jpg',
            },
            {
                id: 4,
                url: 'images/places/birch-grove/4.jpg',
            },
            {
                id: 5,
                url: 'images/places/birch-grove/5.jpg',
            },
            {
                id: 6,
                url: 'images/places/birch-grove/6.jpg',
            },
            {
                id: 7,
                url: 'images/places/birch-grove/7.jpg',
            },
        ],
        videos: [
            {
                id: 1,
                url: '/video/birch-grove.mp4',
            }
        ],
        desc: '4,7 га светлой березовой рощи, близость ивановского озера, включение в уникальную инфраструктуру усадебного комплекса Ушмор,  наличие коммуникаций ( газ, электричество, асфальтовая дорога, возможность проведения водопровода от глубинной скважины) делают участок привлекательным для инвестирования в мини дачный поселок в традициях старых сталинских дач.',
    },
    {
        id: 3,
        title: 'Ушмор-парк',
        price: '5 000 000',
        area: '1.2 га',
        cadastralNumber: '62:05:2510101:179, 62:05:2790601:190',
        backgroundImage: '/images/places/ushmore-park/index.jpg',
        path: "M 686.52734 198.30664 L 623.76953 239.49609 L 629.44922 247.00195 L 631.4043 247.35742 L 701.29883 214.5625 L 686.52734 198.30664 z M 703.24023 216.81836 L 631.75 249.26367 L 633.86133 252.00586 L 631.41797 253.61719 L 629.62305 253.33398 L 629.26367 254.96484 L 630.37695 256.81055 L 641.16406 270.94922 L 644.4707 274.44727 L 650.01758 276.91406 L 655.97656 277.35352 L 660.89453 278.88477 L 663.28711 270.76758 L 660.35352 268.22266 L 707.40234 220.5918 L 703.24023 216.81836 z ",
        photos: [
            {
                id: 1,
                url: 'images/places/ushmore-park/1.jpg',
            },
            {
                id: 2,
                url: 'images/places/ushmore-park/2.jpg',
            },
            {
                id: 3,
                url: 'images/places/ushmore-park/3.jpg',
            },
            {
                id: 4,
                url: 'images/places/ushmore-park/4.jpg',
            },
            {
                id: 5,
                url: 'images/places/ushmore-park/5.jpg',
            },
            {
                id: 6,
                url: 'images/places/ushmore-park/6.jpg',
            },
            {
                id: 7,
                url: 'images/places/ushmore-park/7.jpg',
            },
            {
                id: 8,
                url: 'images/places/ushmore-park/8.jpg',
            },
        ],
        videos: [
            {
                id: 1,
                url: '/video/ushmore-park.mp4',
            }
        ],
        desc: 'Описание:ИЖС, в границах населенного пункта деревня Ушмор.\n' +
            'Проведена планировка территории (асфальтовые дорожки, беседка в классическом стиле, маленький прудик, 2 круглосуточно охраняемые парковки), разбит ландшафтный парк с более 50 видами деревьев и кустарников, в том числе экзотических.\n' +
            'ГАЗ на границе с участком, электричество, возможна организация водоснабжения (рядом глубинная скважина).\n' +
            'В 5 минутах Ивановское озеро. Храм. Возможна рассрочками до года.' ,
    },
    {
        id: 4,
        title: 'Ушморское поле (64 га)',
        price: '22 000 000',
        area: '64 га',
        cadastralNumber: '62:05:2510101:92',
        backgroundImage: '/images/places/village-ushmor/index.jpg',
        path: "m 406.36087,127.86028 1.90298,-4.51392 c 0,0 36.77732,-13.54327 37.5075,-13.64955 0.73019,-0.10627 8.6385,-2.48339 8.6385,-2.48339 l 16.3927,13.15873 13.27818,11.50546 13.11299,10.93434 7.19487,6.65288 12.11583,-6.6957 10.01661,-4.28825 3.58874,-0.3582 16.46695,12.63119 9.02723,10.44023 15.52327,16.84117 14.05895,15.39668 6.79229,8.5039 3.44518,4.68691 -2.14304,5.24415 -4.57829,6.33523 -4.93719,2.91393 -23.9668,10.20945 -21.72609,10.99891 -35.33412,17.61757 -22.27495,10.98219 -18.51164,10.34211 -4.1948,0.48345 -13.65261,3.03615 -18.17515,4.84317 -7.04445,1.16869 -13.17292,6.3002 -8.02023,5.51524 -6.01349,3.818 -6.28525,3.41443 -7.54019,5.20936 -12.02498,4.29912 -14.88389,5.91598 -10.82751,2.99823 -9.41805,2.75788 -4.77483,0.4761 -3.01282,1.97937 -5.43948,-0.46217 h -2.66824 l -5.06844,2.63701 -4.75116,-0.72155 -4.45832,0.93797 -4.21172,2.10325 -11.67727,-1.3302 -6.69195,-8.94303 0.97072,-3.4952 2.2821,-4.6074 0.70122,-3.98054 -2.58411,-3.14529 -0.81486,-3.33125 -2.80259,-4.62301 -3.54874,-2.83937 -3.25962,-7.73194 -3.81993,-1.40705 -3.82114,-1.77977 -0.22259,-2.46319 -2.13599,-5.83518 5.1589,-12.76682 3.92751,-8.6376 7.02375,-5.1137 8.14361,-4.45523 5.00521,-4.83221 11.66736,-15.45365 7.24494,-10.71786 1.74478,-2.30213 5.69796,0.69333 8.1991,-6.16371 11.82003,-5.99052 15.01321,-5.19816 4.27727,-1.54062 11.33625,-0.72716 8.7826,-0.47761 8.11028,-2.19851 11.76196,-6.13432 8.45051,-5.3468 4.69189,-4.3258 2.4191,-3.11707 2.5575,-4.18419 6.06999,-2.2507 20.492,-9.18956 -0.94747,-2.84053 -22.14276,-21.94025 -6.2415,-5.53428 z, m 623.33212,239.60655 62.668,-40.48282 15.38348,14.65266 -23.52928,11.21975 -47.52175,22.66037 z",
        photos: [
            {
                id: 1,
                url: 'images/places/village-ushmor/1.jpg',
            },
            {
                id: 2,
                url: 'images/places/village-ushmor/2.jpg',
            },
            {
                id: 3,
                url: 'images/places/village-ushmor/3.jpg',
            },
            {
                id: 4,
                url: 'images/places/village-ushmor/4.jpg',
            },
            {
                id: 5,
                url: 'images/places/village-ushmor/5.jpg',
            },
        ],
        videos: [
            {
                id: 1,
                url: '/video/village-ushmor.mp4',
            }
        ],
        desc: 'Вид разрешенного использования: ИЖС, гостиничное обслуживание, отдых.\n' +
            'Большой ровный участок находится в границах населенного пункта деревня Ушмор, идеально подходит для инвестирования в строительство дачного поселка, туристической инфраструктуры.\n' +
            'Расположен вблизи границы с Московской областью, окружен с 3 сторон лесом (Мещерский Национальный парк), недалеко от Иванковского озера.\n' +
            'Практически до участка проложена асфальтовая дорога, рядом газ, электричество.\n' +
            'У участка нет обременений: находится за пределами национального парка и его охранной зоны.\n' +
            'Возможна рассрочка до года.',
    },
    {
        id: 5,
        title: 'Участок Фролово',
        price: '23 000',
        area: 'от 16.2 до 32,4 сотки',
        cadastralNumber: '62:05:2790601:187',
        backgroundImage: '/images/places/village-frolovo/index.jpg',
        path: "m 662.49954,397.01522 140.08115,15.18326 36.87556,73.95898 -0.0966,0.53708 -66.19491,-10.43161 -45.75271,-8.13152 -38.43843,-6.87855 -26.37386,-4.45233 z",
        photos: [
            {
                id: 1,
                url: 'images/places/village-frolovo/1.jpg',
            },
            {
                id: 2,
                url: 'images/places/village-frolovo/2.jpg',
            },
            {
                id: 3,
                url: 'images/places/village-frolovo/3.jpg',
            },
            {
                id: 4,
                url: 'images/places/village-frolovo/4.jpg',
            },
            {
                id: 5,
                url: 'images/places/village-frolovo/5.jpg',
            },
            {
                id: 6,
                url: 'images/places/village-frolovo/6.jpg',
            },
            {
                id: 7,
                url: 'images/places/village-frolovo/7.jpg',
            },
        ],
        videos: [
            {
                id: 1,
                url: '/video/village-frolovo.mp4',
            }
        ],
        desc: 'Продаются участки от 16,2  до 32, 4 соток. Земля под ИЖС, для объектов жилой застройки, в границах населенного пункта.  Земля размежевана, Вы можете подобрать для себя любой понравившейся участок. Земля находится в уникальном месте! Рядом, в 200-х, метрах располагается озеро Ивановское, одно из крупнейших озер Мещёры, с удивительно красивыми видами .Участок граничит с лесом ,имеется асфальтированная дорога. Рядом проходят коммуникации (электричество ,газ). Участок включен в границы населенного пункта. В дачном поселке проживают приличные соседи. До районного центра Спас-Клепики 15 км, до границы с Московской областью -2 км.',
    },
    {
        id: 6,
        title: 'Эксклюзивное предложение!',
        price: '15 000 000',
        area: '126 кв.м',
        cadastralNumber: '',
        backgroundImage: '/images/places/exclusive/index.jpg',
        path: "m 578.30784,252.82687 6.95493,14.45318 20.67839,-9.20901 -8.2891,-13.71494 z",
        photos: [
            {
                id: 1,
                url: 'images/places/exclusive/1.jpg',
            },
            {
                id: 2,
                url: 'images/places/exclusive/2.jpg',
            },
            {
                id: 3,
                url: 'images/places/exclusive/3.jpg',
            },
            {
                id: 4,
                url: 'images/places/exclusive/4.jpg',
            },
            {
                id: 5,
                url: 'images/places/exclusive/5.jpg',
            },
            {
                id: 6,
                url: 'images/places/exclusive/6.jpg',
            },
            {
                id: 7,
                url: 'images/places/exclusive/7.jpg',
            },
            {
                id: 8,
                url: 'images/places/exclusive/8.jpg',
            },
            {
                id: 9,
                url: 'images/places/exclusive/9.jpg',
            },
            {
                id: 10,
                url: 'images/places/exclusive/10.jpg',
            },
            {
                id: 11,
                url: 'images/places/exclusive/11.jpg',
            },
            {
                id: 12,
                url: 'images/places/exclusive/12.jpg',
            },
            {
                id: 13,
                url: 'images/places/exclusive/13.jpg',
            },
            {
                id: 14,
                url: 'images/places/exclusive/14.jpg',
            },
            {
                id: 15,
                url: 'images/places/exclusive/15.jpg',
            },
            {
                id: 16,
                url: 'images/places/exclusive/16.jpg',
            },
            {
                id: 17,
                url: 'images/places/exclusive/17.jpg',
            },
            {
                id: 18,
                url: 'images/places/exclusive/18.jpg',
            },
            {
                id: 19,
                url: 'images/places/exclusive/19.jpg',
            },
        ],
        videos: [],
        desc: 'На участке 17 соток в самом центре Мещеры продаются два дома. В гостевом доме уютная планировка, хороший ремонт, все условия для отличной семейной жизни.\n' +
            'Второй дом – притчевый – с купелью, классными комнатами, библиотекой, коваными перилами и ручной росписью на потолке. Нет никаких ограничений на перепланировку и реконструкцию.',
    },
];

export const menu: Menu[] = [
    {
        title: 'Главная',
        url: 'welcome'
    },
    {
        title: 'Земля в центре Мещеры',
        url: 'places'
    },
    {
        title: 'Карта',
        url: 'map'
    },
    {
        title: 'Контакты',
        url: 'contacts'
    },
];
